{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 108,
   "metadata": {},
   "outputs": [],
   "source": [
    "import rdflib\n",
    "from rdflib import Graph, Literal, BNode, Namespace, RDF, URIRef\n",
    "from rdflib.namespace import DC, FOAF\n",
    "import spotlight\n",
    "import urllib, json\n",
    "import pandas as pd\n",
    "from collections import Counter\n",
    "import random\n",
    "import os\n",
    "cn = Namespace(\"http://nhscausalknowledgegraph.org/condtion/\")\n",
    "owl = Namespace(\"http://www.w3.org/2002/07/owl#\")\n",
    "import numpy as np"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [],
   "source": [
    "# load the graph\n",
    "g = rdflib.Graph()\n",
    "result = g.parse('cknns/nhskg', format='turtle')\n",
    "\n",
    "# setting self-namespaces \n",
    "causes = URIRef(cn.causesDisease)\n",
    "anatomicOn = URIRef(cn.causeOnAnatomicStructure)\n",
    "drug = URIRef(cn.drugTo)\n",
    "diag = URIRef(cn.diagnosisTo)\n",
    "symptomOf = URIRef(cn.causesSymptom)\n",
    "treatment = URIRef(cn.treatmentTo)\n",
    "#question=  URIRef(cn.question)\n",
    "seasonOf = URIRef(cn.seasonAffectTo)\n",
    "hasCP = URIRef(cn.hasCausalProbablity)\n",
    "#anabout = URIRef(cn.aLabel)\n",
    "sameAs = URIRef(owl.sameAs)\n",
    "agegroup = URIRef(cn.causesAffectionToAgeGroup)\n",
    "physiologyOf = URIRef(cn.causesPhysiology)\n",
    "habitTo = URIRef(cn.HabitCausesTo)\n",
    "speciesTo = URIRef(cn.SpeciesCausesTo)\n",
    "disease = URIRef('http://dbpedia.org/ontology/Disease')\n",
    "wikidisease = URIRef('https://www.wikidata.org/wiki/Q12136')\n",
    "anat = URIRef('http://dbpedia.org/ontology/AnatomicalStructure')\n",
    "wikianat = URIRef('https://www.wikidata.org/wiki/Q4936952')\n",
    "symp = URIRef('http://dbpedia.org/resource/Category:Symptoms_and_signs')\n",
    "presign = URIRef('http://purl.org/dc/terms/subject')\n",
    "drugs = URIRef('http://dbpedia.org/ontology/Drug')\n",
    "condition = URIRef('http://umbel.org/umbel/rc/AilmentCondition')\n",
    "diseaseProperty = URIRef('http://dbpedia.org/property/diseasesdb')\n",
    "diags = URIRef('http://dbpedia.org/page/Medical_diagnosis')\n",
    "treats = URIRef('http://dbpedia.org/page/Therapy')\n",
    "ages = URIRef('http://dbpedia.org/page/Category:Human_development')\n",
    "sex = URIRef('http://dbpedia.org/page/Category:Sex')\n",
    "season = URIRef('http://dbpedia.org/page/Season')\n",
    "species = URIRef('http://dbpedia.org/ontology/Species')\n",
    "physiology = URIRef('http://dbpedia.org/page/Category:Human_physiology')\n",
    "habit = URIRef('http://dbpedia.org/page/Category:Habits')\n",
    "pt = URIRef(cn.causalityTo)\n",
    "pv = URIRef(cn.pvalue)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 237,
   "metadata": {},
   "outputs": [],
   "source": [
    "def spalq_condition_ds(sym,pg):\n",
    "    #pg = rdflib.Graph()\n",
    "    #pg.parse('cknns/pkg.ttl', format='turtle')\n",
    "    #print (result)\n",
    "    #print (qres)\n",
    "    d = []\n",
    "    for si in sym:\n",
    "        querystring = \"SELECT DISTINCT ?d ?s WHERE {\"\n",
    "        querystring = querystring+\"?d <\"+RDF.type+\"> <\"+disease+\"> . \" \n",
    "        querystring = querystring+\"?d ?p ?s FILTER regex(str(?s), '\"+si+\"') . }\" \n",
    "        qres = g.query(querystring)\n",
    "        print(si,len(qres))\n",
    "        for row in qres:\n",
    "            di = str(row.asdict()['d'].toPython()).split('/')[-1]\n",
    "            #print (di)\n",
    "            pvstring = str((1.0/len(qres)))\n",
    "            #print (pvstring)\n",
    "            snode = BNode()\n",
    "            subj = URIRef(row.asdict()['d'].toPython())\n",
    "            obj = URIRef(row.asdict()['s'].toPython())\n",
    "            pg.add( (subj, RDF.type, disease) )\n",
    "            pg.add( (obj, RDF.type, symp) )\n",
    "            pg.add( (subj, hasCP, snode ) )\n",
    "            pg.add( (snode, pt, obj) )\n",
    "            pg.add( (snode, pv, Literal(pvstring)) )\n",
    "            d.append(di)\n",
    "    #pg.serialize(destination='cknns/pkg.ttl', format='turtle')\n",
    "    #pg.close()\n",
    "    return d"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 238,
   "metadata": {},
   "outputs": [],
   "source": [
    "def spalq_position_ds(posi,pg):\n",
    "    #pg = rdflib.Graph()\n",
    "    #pg.parse('cknns/pkg.ttl', format='turtle')\n",
    "    #print (result)\n",
    "    #print (qres)\n",
    "    d = []\n",
    "    for si in posi:\n",
    "        querystring = \"SELECT DISTINCT ?d ?s WHERE {\"\n",
    "        querystring = querystring+\"?d <\"+RDF.type+\"> <\"+disease+\"> . \" \n",
    "        querystring = querystring+\"?d <\"+anatomicOn+\"> ?s FILTER regex(str(?s), '\"+si+\"') . }\" \n",
    "        qres = g.query(querystring)\n",
    "        print(si,len(qres))\n",
    "        for row in qres:\n",
    "            di = str(row.asdict()['d'].toPython()).split('/')[-1]\n",
    "            #print (di)\n",
    "            pvstring = str((1.0/len(qres)))\n",
    "            #print (pvstring)\n",
    "            snode = BNode()\n",
    "            subj = URIRef(row.asdict()['d'].toPython())\n",
    "            obj = URIRef(row.asdict()['s'].toPython())\n",
    "            pg.add( (subj, RDF.type, disease) )\n",
    "            pg.add( (obj, RDF.type, anat) )\n",
    "            pg.add( (subj, hasCP, snode ) )\n",
    "            pg.add( (snode, pt, obj) )\n",
    "            pg.add( (snode, pv, Literal(pvstring)) )\n",
    "            d.append(di)\n",
    "    #pg.serialize(destination='cknns/pkg.ttl', format='turtle')\n",
    "    #pg.close()\n",
    "    return d"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 286,
   "metadata": {},
   "outputs": [],
   "source": [
    "def spalq_pre_history(dis,sym,pg):\n",
    "    #pg = rdflib.Graph()\n",
    "    #pg.parse('cknns/pkg.ttl', format='turtle')\n",
    "    #print (result)\n",
    "    #print (qres)\n",
    "    d = []\n",
    "    d1 = []\n",
    "    if dis != '':\n",
    "        for si in sym:\n",
    "            si = si.replace(' ','-')\n",
    "            querystring = \"SELECT DISTINCT ?d ?d1 ?s WHERE {\"\n",
    "            querystring = querystring+\"?d <\"+RDF.type+\"> <\"+disease+\"> FILTER regex(str(?d), '\"+dis+\"') . \" \n",
    "            querystring = querystring+\"?d <\"+causes+\"> ?d1 .\"\n",
    "            querystring = querystring+\"?d1 ?p ?s FILTER regex(str(?s), '\"+si+\"') . }\"\n",
    "            qres = g.query(querystring)\n",
    "            print(si,len(qres))\n",
    "            for row in qres:\n",
    "                di = str(row.asdict()['d'].toPython()).split('/')[-1]\n",
    "                print (di)\n",
    "                pvstring = str((1.0/len(qres)))\n",
    "                print (pvstring)\n",
    "                snode = BNode()\n",
    "                subj = URIRef(row.asdict()['d'].toPython())\n",
    "                obj1 = URIRef(row.asdict()['d1'].toPython())\n",
    "                obj2 = URIRef(row.asdict()['s'].toPython())\n",
    "                pg.add( (subj, RDF.type, disease) )\n",
    "                pg.add( (obj1, RDF.type, disease) )\n",
    "                pg.add( (subj, causes, obj1) )\n",
    "                pg.add( (subj, hasCP, snode ) )\n",
    "                pg.add( (snode, pt, obj1) )\n",
    "                pg.add( (snode, pt, obj2) )\n",
    "                pg.add( (snode, pv, Literal(pvstring)) )\n",
    "                d.append(di)\n",
    "                d1.append(obj1)\n",
    "    #pg.serialize(destination='cknns/pkg.ttl', format='turtle')\n",
    "    #pg.close()\n",
    "    return d,d1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 240,
   "metadata": {},
   "outputs": [],
   "source": [
    "def spalq_age_ds(ageg,t,pg):\n",
    "    #pg = rdflib.Graph()\n",
    "    #pg.parse('cknns/pkg.ttl', format='turtle')\n",
    "    #print (result)\n",
    "    #print (qres)\n",
    "    d = []\n",
    "    for si in ageg:\n",
    "        querystring = \"SELECT DISTINCT ?d ?s WHERE {\"\n",
    "        querystring = querystring+\"?d <\"+RDF.type+\"> <\"+disease+\"> . \" \n",
    "        querystring = querystring+\"?d <\"+agegroup+\"> ?s FILTER regex(str(?s), '\"+si+\"') . }\" \n",
    "        qres = g.query(querystring)\n",
    "        print(si,len(qres))\n",
    "        for row in qres:\n",
    "            di = str(row.asdict()['d'].toPython()).split('/')[-1]\n",
    "            #print (di)\n",
    "            pvstring = str((1.0/len(qres)))\n",
    "            #print (pvstring)\n",
    "            snode = BNode()\n",
    "            subj = URIRef(row.asdict()['d'].toPython())\n",
    "            obj = URIRef(row.asdict()['s'].toPython())\n",
    "            pg.add( (subj, RDF.type, disease) )\n",
    "            if t==0:\n",
    "                pg.add( (obj, RDF.type, ages) )\n",
    "            else:\n",
    "                pg.add( (obj, RDF.type, sex) )\n",
    "            pg.add( (subj, hasCP, snode ) )\n",
    "            pg.add( (snode, pt, obj) )\n",
    "            pg.add( (snode, pv, Literal(pvstring)) )\n",
    "            d.append(di)\n",
    "    #pg.serialize(destination='cknns/pkg.ttl', format='turtle')\n",
    "    #pg.close()\n",
    "    return d"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 284,
   "metadata": {},
   "outputs": [],
   "source": [
    "#PKG GENERATION FUNCTION!\n",
    "def predict_inputs(_syms,_anat,pre_dis,_age,_sex):\n",
    "    pg = rdflib.Graph()\n",
    "    spalq_condition_ds(_syms,pg)\n",
    "    spalq_position_ds(_anat,pg)\n",
    "    spalq_pre_history(pre_dis,_syms,pg)\n",
    "    spalq_age_ds(_age,0,pg)\n",
    "    spalq_age_ds(_sex,1,pg)\n",
    "    pg.serialize(destination='cknns/a_pkg.ttl', format='turtle')\n",
    "    pg.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 295,
   "metadata": {},
   "outputs": [],
   "source": [
    "def predict_ranking_dic(in1,in2,in3,in4,in5):\n",
    "    predict_inputs(in1,in2,in3,in4,in5)\n",
    "    pdictg = rdflib.Graph()\n",
    "    pdictg.parse('cknns/a_pkg.ttl', format='turtle')\n",
    "    querystring = \"SELECT DISTINCT ?d ?tp ?v WHERE {\"\n",
    "    querystring = querystring+\"?d <\"+RDF.type+\"> <\"+disease+\"> . \" \n",
    "    querystring = querystring+\"?d <\"+hasCP+\"> ?cp . \"\n",
    "    querystring = querystring+\"?cp <\"+pt+\"> ?t . ?t <\"+RDF.type+\"> ?tp . ?cp <\"+pv+\"> ?v}\"\n",
    "    print (querystring)\n",
    "    qres = pdictg.query(querystring)\n",
    "    ddict = {}\n",
    "    sexv = []\n",
    "    agev = []\n",
    "    asv = []\n",
    "    sdv = []\n",
    "    indv = []\n",
    "    for row in qres:\n",
    "        di = str(row.asdict()['d'].toPython()).split('/')[-1]\n",
    "        ti = str(row.asdict()['tp'].toPython()).split('/')[-1]\n",
    "        tv = str(row.asdict()['v'].toPython()).split('/')[-1]\n",
    "        #print (di,ti,tv)\n",
    "        if di not in ddict:\n",
    "            sexv = []\n",
    "            agev = []\n",
    "            asv = []\n",
    "            sdv = []\n",
    "            indv = []\n",
    "        if ti =='Category:Sex':\n",
    "            #print (tv)\n",
    "            sexv.append(tv)\n",
    "        elif ti =='Category:Human_development':\n",
    "            #print (tv)\n",
    "            agev.append(tv)\n",
    "        elif ti =='AnatomicalStructure':\n",
    "            asv.append(tv)\n",
    "        else:\n",
    "            if ti =='Category:Symptoms_and_signs':\n",
    "                sdv.append(tv)\n",
    "            else:\n",
    "                indv.append(tv)\n",
    "        #print (sdv,asv,sdv)\n",
    "        ddict[di] = [sdv,asv,agev,sexv,indv] \n",
    "    return ddict"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 293,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> < does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> .  does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d ?p ?s FILTER regex(str(?s), ' does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d ?p ?s FILTER regex(str(?s), 'Cough does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d ?p ?s FILTER regex(str(?s), 'Cough') . } does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> < does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> .  does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d ?p ?s FILTER regex(str(?s), ' does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d ?p ?s FILTER regex(str(?s), 'Breathing does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d ?p ?s FILTER regex(str(?s), 'Breathing') . } does not look like a valid URI, trying to serialize this will break.\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Cough 55\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> < does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> .  does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d ?p ?s FILTER regex(str(?s), ' does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d ?p ?s FILTER regex(str(?s), 'Fever does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d ?p ?s FILTER regex(str(?s), 'Fever') . } does not look like a valid URI, trying to serialize this will break.\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Breathing 56\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> < does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> .  does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d ?p ?s FILTER regex(str(?s), ' does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d ?p ?s FILTER regex(str(?s), 'Heartbeat does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d ?p ?s FILTER regex(str(?s), 'Heartbeat') . } does not look like a valid URI, trying to serialize this will break.\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Fever 120\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> < does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> .  does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d ?p ?s FILTER regex(str(?s), ' does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d ?p ?s FILTER regex(str(?s), 'Chest_pain does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d ?p ?s FILTER regex(str(?s), 'Chest_pain') . } does not look like a valid URI, trying to serialize this will break.\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Heartbeat 21\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> < does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> .  does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d ?p ?s FILTER regex(str(?s), ' does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d ?p ?s FILTER regex(str(?s), 'Fatigue does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d ?p ?s FILTER regex(str(?s), 'Fatigue') . } does not look like a valid URI, trying to serialize this will break.\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Chest_pain 45\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> < does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> .  does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d ?p ?s FILTER regex(str(?s), ' does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d ?p ?s FILTER regex(str(?s), 'Shivering does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d ?p ?s FILTER regex(str(?s), 'Shivering') . } does not look like a valid URI, trying to serialize this will break.\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Fatigue 33\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> < does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> .  does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d ?p ?s FILTER regex(str(?s), ' does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d ?p ?s FILTER regex(str(?s), 'Infection does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d ?p ?s FILTER regex(str(?s), 'Infection') . } does not look like a valid URI, trying to serialize this will break.\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Shivering 0\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> < does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> .  does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d ?p ?s FILTER regex(str(?s), ' does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d ?p ?s FILTER regex(str(?s), 'Unwell does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d ?p ?s FILTER regex(str(?s), 'Unwell') . } does not look like a valid URI, trying to serialize this will break.\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Infection 186\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> < does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> .  does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d < does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d <http://nhscausalknowledgegraph.org/condtion/causeOnAnatomicStructure does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d <http://nhscausalknowledgegraph.org/condtion/causeOnAnatomicStructure does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d <http://nhscausalknowledgegraph.org/condtion/causeOnAnatomicStructure> ?s FILTER regex(str(?s), ' does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d <http://nhscausalknowledgegraph.org/condtion/causeOnAnatomicStructure> ?s FILTER regex(str(?s), 'Lung does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d <http://nhscausalknowledgegraph.org/condtion/causeOnAnatomicStructure> ?s FILTER regex(str(?s), 'Lung') . } does not look like a valid URI, trying to serialize this will break.\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Unwell 27\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> < does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> .  does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d < does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d <http://nhscausalknowledgegraph.org/condtion/causesAffectionToAgeGroup does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d <http://nhscausalknowledgegraph.org/condtion/causesAffectionToAgeGroup does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d <http://nhscausalknowledgegraph.org/condtion/causesAffectionToAgeGroup> ?s FILTER regex(str(?s), ' does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d <http://nhscausalknowledgegraph.org/condtion/causesAffectionToAgeGroup> ?s FILTER regex(str(?s), 'Child does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d <http://nhscausalknowledgegraph.org/condtion/causesAffectionToAgeGroup> ?s FILTER regex(str(?s), 'Child') . } does not look like a valid URI, trying to serialize this will break.\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Lung 45\n",
      "Child 133\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> < does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> .  does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d < does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d <http://nhscausalknowledgegraph.org/condtion/causesAffectionToAgeGroup does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d <http://nhscausalknowledgegraph.org/condtion/causesAffectionToAgeGroup does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d <http://nhscausalknowledgegraph.org/condtion/causesAffectionToAgeGroup> ?s FILTER regex(str(?s), ' does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d <http://nhscausalknowledgegraph.org/condtion/causesAffectionToAgeGroup> ?s FILTER regex(str(?s), 'Male does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d <http://nhscausalknowledgegraph.org/condtion/causesAffectionToAgeGroup> ?s FILTER regex(str(?s), 'Male') . } does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> < does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> .  does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d < does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d <http://nhscausalknowledgegraph.org/condtion/causesAffectionToAgeGroup does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d <http://nhscausalknowledgegraph.org/condtion/causesAffectionToAgeGroup does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d <http://nhscausalknowledgegraph.org/condtion/causesAffectionToAgeGroup> ?s FILTER regex(str(?s), ' does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d <http://nhscausalknowledgegraph.org/condtion/causesAffectionToAgeGroup> ?s FILTER regex(str(?s), 'Man does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?s WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d <http://nhscausalknowledgegraph.org/condtion/causesAffectionToAgeGroup> ?s FILTER regex(str(?s), 'Man') . } does not look like a valid URI, trying to serialize this will break.\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Male 25\n",
      "Man 42\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "SELECT DISTINCT ?d ?tp ?v WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?tp ?v WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> < does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?tp ?v WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?tp ?v WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?tp ?v WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> .  does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?tp ?v WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d < does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?tp ?v WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d <http://nhscausalknowledgegraph.org/condtion/hasCausalProbablity does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?tp ?v WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d <http://nhscausalknowledgegraph.org/condtion/hasCausalProbablity does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?tp ?v WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d <http://nhscausalknowledgegraph.org/condtion/hasCausalProbablity> ?cp .  does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?tp ?v WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d <http://nhscausalknowledgegraph.org/condtion/hasCausalProbablity> ?cp . ?cp < does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?tp ?v WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d <http://nhscausalknowledgegraph.org/condtion/hasCausalProbablity> ?cp . ?cp <http://nhscausalknowledgegraph.org/condtion/causalityTo does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?tp ?v WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d <http://nhscausalknowledgegraph.org/condtion/hasCausalProbablity> ?cp . ?cp <http://nhscausalknowledgegraph.org/condtion/causalityTo does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?tp ?v WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d <http://nhscausalknowledgegraph.org/condtion/hasCausalProbablity> ?cp . ?cp <http://nhscausalknowledgegraph.org/condtion/causalityTo> ?t . ?t < does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?tp ?v WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d <http://nhscausalknowledgegraph.org/condtion/hasCausalProbablity> ?cp . ?cp <http://nhscausalknowledgegraph.org/condtion/causalityTo> ?t . ?t <http://www.w3.org/1999/02/22-rdf-syntax-ns#type does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?tp ?v WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d <http://nhscausalknowledgegraph.org/condtion/hasCausalProbablity> ?cp . ?cp <http://nhscausalknowledgegraph.org/condtion/causalityTo> ?t . ?t <http://www.w3.org/1999/02/22-rdf-syntax-ns#type does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?tp ?v WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d <http://nhscausalknowledgegraph.org/condtion/hasCausalProbablity> ?cp . ?cp <http://nhscausalknowledgegraph.org/condtion/causalityTo> ?t . ?t <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> ?tp . ?cp < does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?tp ?v WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d <http://nhscausalknowledgegraph.org/condtion/hasCausalProbablity> ?cp . ?cp <http://nhscausalknowledgegraph.org/condtion/causalityTo> ?t . ?t <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> ?tp . ?cp <http://nhscausalknowledgegraph.org/condtion/pvalue does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?tp ?v WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d <http://nhscausalknowledgegraph.org/condtion/hasCausalProbablity> ?cp . ?cp <http://nhscausalknowledgegraph.org/condtion/causalityTo> ?t . ?t <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> ?tp . ?cp <http://nhscausalknowledgegraph.org/condtion/pvalue does not look like a valid URI, trying to serialize this will break.\n",
      "SELECT DISTINCT ?d ?tp ?v WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d <http://nhscausalknowledgegraph.org/condtion/hasCausalProbablity> ?cp . ?cp <http://nhscausalknowledgegraph.org/condtion/causalityTo> ?t . ?t <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> ?tp . ?cp <http://nhscausalknowledgegraph.org/condtion/pvalue> ?v} does not look like a valid URI, trying to serialize this will break.\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "SELECT DISTINCT ?d ?tp ?v WHERE {?d <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Disease> . ?d <http://nhscausalknowledgegraph.org/condtion/hasCausalProbablity> ?cp . ?cp <http://nhscausalknowledgegraph.org/condtion/causalityTo> ?t . ?t <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> ?tp . ?cp <http://nhscausalknowledgegraph.org/condtion/pvalue> ?v}\n",
      "0 28.19294508596094\n",
      "0 3.8066624897703196\n",
      "0 4.890349128221754\n",
      "0 6.956545443151569\n",
      "0 0\n",
      "0.24206729216780515\n",
      "0.6818919815529829\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>d</th>\n",
       "      <th>pred_v</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>241</th>\n",
       "      <td>Pneumonia</td>\n",
       "      <td>80.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>294</th>\n",
       "      <td>Cystic-fibrosis</td>\n",
       "      <td>78.838983</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>119</th>\n",
       "      <td>Chest-infection</td>\n",
       "      <td>75.965158</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Bronchiolitis</td>\n",
       "      <td>75.603460</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>111</th>\n",
       "      <td>Epiglottitis</td>\n",
       "      <td>75.603460</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>146</th>\n",
       "      <td>Asthma</td>\n",
       "      <td>74.211864</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>228</th>\n",
       "      <td>Granulomatosis-with-polyangiitis</td>\n",
       "      <td>71.004332</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>227</th>\n",
       "      <td>Schistosomiasis</td>\n",
       "      <td>70.279575</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>67</th>\n",
       "      <td>Tuberculosis-tb</td>\n",
       "      <td>70.254011</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>239</th>\n",
       "      <td>Sickle-cell-disease</td>\n",
       "      <td>69.917877</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>268</th>\n",
       "      <td>Scleroderma</td>\n",
       "      <td>69.917877</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>271</th>\n",
       "      <td>Mesothelioma</td>\n",
       "      <td>68.550897</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>306</th>\n",
       "      <td>Air-embolism</td>\n",
       "      <td>68.531417</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>303</th>\n",
       "      <td>Bronchitis</td>\n",
       "      <td>68.189198</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>126</th>\n",
       "      <td>Kyphosis</td>\n",
       "      <td>68.086235</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>320</th>\n",
       "      <td>Sars</td>\n",
       "      <td>65.603460</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>57</th>\n",
       "      <td>Pleurisy</td>\n",
       "      <td>64.211864</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>158</th>\n",
       "      <td>Asbestosis</td>\n",
       "      <td>64.211864</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>290</th>\n",
       "      <td>Idiopathic-pulmonary-fibrosis</td>\n",
       "      <td>64.211864</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>254</th>\n",
       "      <td>Acute-respiratory-distress-syndrome</td>\n",
       "      <td>63.125409</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>Mitral-valve-problems</td>\n",
       "      <td>62.095512</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>293</th>\n",
       "      <td>Chronic-obstructive-pulmonary-disease-copd</td>\n",
       "      <td>58.500717</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>171</th>\n",
       "      <td>Persistent-trophoblastic-disease-choriocarcinoma</td>\n",
       "      <td>58.500717</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>60</th>\n",
       "      <td>Kaposis-sarcoma</td>\n",
       "      <td>58.500717</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>Iron-deficiency-anaemia</td>\n",
       "      <td>57.444961</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>115</th>\n",
       "      <td>Mouth-cancer</td>\n",
       "      <td>57.442252</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>156</th>\n",
       "      <td>Vulval-cancer</td>\n",
       "      <td>57.414261</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>98</th>\n",
       "      <td>Noonan-syndrome</td>\n",
       "      <td>57.414261</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Autosomal-recessive-polycystic-kidney-disease-...</td>\n",
       "      <td>55.711147</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>212</th>\n",
       "      <td>Acromegaly</td>\n",
       "      <td>54.960826</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>304</th>\n",
       "      <td>Oesophageal-atresia</td>\n",
       "      <td>5.711147</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>210</th>\n",
       "      <td>Obsessive-compulsive-disorder-ocd</td>\n",
       "      <td>5.711147</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>182</th>\n",
       "      <td>Pelvic-organ-prolapse</td>\n",
       "      <td>5.685583</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>179</th>\n",
       "      <td>Malignant-brain-tumour</td>\n",
       "      <td>5.685583</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>321</th>\n",
       "      <td>Subarachnoid-haemorrhage</td>\n",
       "      <td>5.685583</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>143</th>\n",
       "      <td>Reflux-in-babies</td>\n",
       "      <td>5.685583</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>159</th>\n",
       "      <td>Urinary-incontinence</td>\n",
       "      <td>5.685583</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>204</th>\n",
       "      <td>Indigestion</td>\n",
       "      <td>5.400872</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>Coronary-heart-disease</td>\n",
       "      <td>5.400872</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>162</th>\n",
       "      <td>Angina</td>\n",
       "      <td>5.400872</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Cushings-syndrome</td>\n",
       "      <td>5.372882</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>107</th>\n",
       "      <td>Melanoma-skin-cancer</td>\n",
       "      <td>5.372882</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Metabolic-syndrome</td>\n",
       "      <td>5.372882</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>181</th>\n",
       "      <td>Chronic-pancreatitis</td>\n",
       "      <td>5.372882</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>178</th>\n",
       "      <td>Charles-bonnet-syndrome</td>\n",
       "      <td>5.372882</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>73</th>\n",
       "      <td>Brain-aneurysm</td>\n",
       "      <td>5.372882</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>300</th>\n",
       "      <td>Jellyfish-and-other-sea-creature-stings</td>\n",
       "      <td>5.372882</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>127</th>\n",
       "      <td>Prostate-cancer</td>\n",
       "      <td>5.372882</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>112</th>\n",
       "      <td>Multiple-sclerosis</td>\n",
       "      <td>5.372882</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>247</th>\n",
       "      <td>Non-alcoholic-fatty-liver-disease</td>\n",
       "      <td>4.960826</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>281</th>\n",
       "      <td>Kidney-cancer</td>\n",
       "      <td>4.676116</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>96</th>\n",
       "      <td>Sexually-transmitted-infections-stis</td>\n",
       "      <td>4.627118</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>64</th>\n",
       "      <td>Nasal-and-sinus-cancer</td>\n",
       "      <td>4.627118</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>54</th>\n",
       "      <td>Osteoporosis</td>\n",
       "      <td>4.627118</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>109</th>\n",
       "      <td>Multiple-system-atrophy</td>\n",
       "      <td>4.627118</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>88</th>\n",
       "      <td>Hyperparathyroidism</td>\n",
       "      <td>4.319552</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>140</th>\n",
       "      <td>Low-blood-sugar-hypoglycaemia</td>\n",
       "      <td>4.319552</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>144</th>\n",
       "      <td>Stroke</td>\n",
       "      <td>4.319552</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>81</th>\n",
       "      <td>Transient-ischaemic-attack-tia</td>\n",
       "      <td>4.319552</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>122</th>\n",
       "      <td>Anorexia</td>\n",
       "      <td>4.319552</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>322 rows  2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                     d     pred_v\n",
       "241                                          Pneumonia  80.000000\n",
       "294                                    Cystic-fibrosis  78.838983\n",
       "119                                    Chest-infection  75.965158\n",
       "4                                        Bronchiolitis  75.603460\n",
       "111                                       Epiglottitis  75.603460\n",
       "146                                             Asthma  74.211864\n",
       "228                   Granulomatosis-with-polyangiitis  71.004332\n",
       "227                                    Schistosomiasis  70.279575\n",
       "67                                     Tuberculosis-tb  70.254011\n",
       "239                                Sickle-cell-disease  69.917877\n",
       "268                                        Scleroderma  69.917877\n",
       "271                                       Mesothelioma  68.550897\n",
       "306                                       Air-embolism  68.531417\n",
       "303                                         Bronchitis  68.189198\n",
       "126                                           Kyphosis  68.086235\n",
       "320                                               Sars  65.603460\n",
       "57                                            Pleurisy  64.211864\n",
       "158                                         Asbestosis  64.211864\n",
       "290                      Idiopathic-pulmonary-fibrosis  64.211864\n",
       "254                Acute-respiratory-distress-syndrome  63.125409\n",
       "23                               Mitral-valve-problems  62.095512\n",
       "293         Chronic-obstructive-pulmonary-disease-copd  58.500717\n",
       "171   Persistent-trophoblastic-disease-choriocarcinoma  58.500717\n",
       "60                                     Kaposis-sarcoma  58.500717\n",
       "20                             Iron-deficiency-anaemia  57.444961\n",
       "115                                       Mouth-cancer  57.442252\n",
       "156                                      Vulval-cancer  57.414261\n",
       "98                                     Noonan-syndrome  57.414261\n",
       "12   Autosomal-recessive-polycystic-kidney-disease-...  55.711147\n",
       "212                                         Acromegaly  54.960826\n",
       "..                                                 ...        ...\n",
       "304                                Oesophageal-atresia   5.711147\n",
       "210                  Obsessive-compulsive-disorder-ocd   5.711147\n",
       "182                              Pelvic-organ-prolapse   5.685583\n",
       "179                             Malignant-brain-tumour   5.685583\n",
       "321                           Subarachnoid-haemorrhage   5.685583\n",
       "143                                   Reflux-in-babies   5.685583\n",
       "159                               Urinary-incontinence   5.685583\n",
       "204                                        Indigestion   5.400872\n",
       "35                              Coronary-heart-disease   5.400872\n",
       "162                                             Angina   5.400872\n",
       "8                                    Cushings-syndrome   5.372882\n",
       "107                               Melanoma-skin-cancer   5.372882\n",
       "1                                   Metabolic-syndrome   5.372882\n",
       "181                               Chronic-pancreatitis   5.372882\n",
       "178                            Charles-bonnet-syndrome   5.372882\n",
       "73                                      Brain-aneurysm   5.372882\n",
       "300            Jellyfish-and-other-sea-creature-stings   5.372882\n",
       "127                                    Prostate-cancer   5.372882\n",
       "112                                 Multiple-sclerosis   5.372882\n",
       "247                  Non-alcoholic-fatty-liver-disease   4.960826\n",
       "281                                      Kidney-cancer   4.676116\n",
       "96                Sexually-transmitted-infections-stis   4.627118\n",
       "64                              Nasal-and-sinus-cancer   4.627118\n",
       "54                                        Osteoporosis   4.627118\n",
       "109                            Multiple-system-atrophy   4.627118\n",
       "88                                 Hyperparathyroidism   4.319552\n",
       "140                      Low-blood-sugar-hypoglycaemia   4.319552\n",
       "144                                             Stroke   4.319552\n",
       "81                      Transient-ischaemic-attack-tia   4.319552\n",
       "122                                           Anorexia   4.319552\n",
       "\n",
       "[322 rows x 2 columns]"
      ]
     },
     "execution_count": 293,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#ranking process and results with input \n",
    "#testing example: 0 is diabetes testing dataset, 1 is allergy testing dataset, 2 is asthma testing dataset ... 14 is glaucoma \t\n",
    "#we genereted 10 different version of 15 testing datasets and average accurate rate on 91%\n",
    "#set input\n",
    "#NO.1 Food Allergy \n",
    "#input1 = ['Angioedema','Fever']\n",
    "#input2 = ['Mouth','Lip']\n",
    "#input3 = 'tooth-decay'\n",
    "#input4 = ['Child']\n",
    "#input5 = ['Male']\n",
    "#NO.2 Phnumonia\n",
    "input1 = ['Cough','Breathing','Fever','Heartbeat','Chest_pain','Fatigue','Shivering','Infection','Unwell']\n",
    "input2 = ['Lung']\n",
    "input3 = ''\n",
    "input4 = ['Child']\n",
    "input5 = ['Male','Man']\n",
    "preparing = predict_ranking_dic(input1, input2, input5,input4, input5)\n",
    "p0 = []\n",
    "p1 = []\n",
    "p2 = []\n",
    "p3 = []\n",
    "p4 = []\n",
    "for x, y in preparing.items():\n",
    "    if len(y[0])>0:\n",
    "        p=1.0\n",
    "        for sy in y[0]:\n",
    "            p=p*float(sy)\n",
    "            mp=1/p\n",
    "        p0.append(np.log(mp))\n",
    "    else:\n",
    "        p0.append(0)\n",
    "    if len(y[1])>0:\n",
    "        p=1\n",
    "        for sy in y[1]:\n",
    "            p=p*float(sy)\n",
    "            mp=1/p\n",
    "        p1.append(np.log(mp))\n",
    "    else:\n",
    "        p1.append(0)\n",
    "    if len(y[2])>0:\n",
    "        p=1\n",
    "        for sy in y[2]:\n",
    "            p=p*float(sy)\n",
    "            mp=1/p\n",
    "        p2.append(np.log(mp))\n",
    "    else:\n",
    "        p2.append(0)\n",
    "    if len(y[3])>0:\n",
    "        p=1\n",
    "        for sy in y[3]:\n",
    "            p=p*float(sy)\n",
    "            mp=1/p\n",
    "        p3.append(np.log(mp))\n",
    "    else:\n",
    "        p3.append(0)\n",
    "    if len(y[4])>0:\n",
    "        p=1\n",
    "        for sy in y[4]:\n",
    "            p=p*float(sy)\n",
    "            mp=1/p\n",
    "        p4.append(np.log(mp))\n",
    "    else:\n",
    "        p4.append(0)    \n",
    "print (min(p0),max(p0))\n",
    "print (min(p1),max(p1))\n",
    "print (min(p2),max(p2))\n",
    "print (min(p3),max(p3))\n",
    "print (min(p4),max(p4))\n",
    "df = pd.DataFrame(columns=['d', 'pred_v'])\n",
    "i=0\n",
    "for x, y in preparing.items():\n",
    "    esym = 0\n",
    "    eana = 0\n",
    "    eage = 0\n",
    "    esex = 0\n",
    "    eind = 0\n",
    "    if len(y[0])>0:\n",
    "        p=1\n",
    "        for sy in y[0]:\n",
    "            p=p*float(sy)\n",
    "            pc=np.log(1/p)\n",
    "        esym = (pc - min(p0))/(max(p0)-min(p0))\n",
    "    if len(y[1])>0:\n",
    "        p=1\n",
    "        for sy in y[1]:\n",
    "            p=p*float(sy)\n",
    "            pc=np.log(1/p)\n",
    "        eana = (pc - min(p1))/(max(p1)-min(p1))\n",
    "    if len(y[2])>0:\n",
    "        p=1\n",
    "        for sy in y[2]:\n",
    "            p=p*float(sy)\n",
    "            pc=np.log(1/p)\n",
    "        eage = (pc - min(p2))/(max(p2)-min(p2))\n",
    "    if len(y[3])>0:\n",
    "        p=1\n",
    "        for sy in y[3]:\n",
    "            p=p*float(sy)\n",
    "            pc=np.log(1/p)\n",
    "        esex = (pc - min(p3))/(max(p3)-min(p3))\n",
    "    if len(y[4])>0:\n",
    "        p=1\n",
    "        for sy in y[4]:\n",
    "            p=p*float(sy)\n",
    "            pc=np.log(1/p)\n",
    "        eind = (pc - min(p4))/(max(p4)-min(p4))\n",
    "    if eind == 0:\n",
    "        er=(0.4*esym+0.4*eana+0.1*eage+0.1*esex)\n",
    "    else:\n",
    "        er=(0.4*esym+0.4*eana+0.1*eage+0.1*esex)*eind\n",
    "    if x =='Food-allergy':\n",
    "        print(er)\n",
    "    if x =='Bronchitis':\n",
    "        print(er)\n",
    "    df.loc[i]=x,er*100\n",
    "    i=i+1\n",
    "df.sort_values(by='pred_v', ascending=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 214,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 64,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
